// 버스 정류장 마커 표시를 위한 5511번 버스 정류장 위치 좌표 배열
// -> 마커 중복 피하기 위해 중복된 정류장 제외
export const bus_5511Stations_forMarker = [
  {
    name: "서울대학교(중앙대학교 방면)",
    position: [37.4667414611, 126.9479522861],
  },
  { name: "서울대정문(중앙대학교 방면)", position: [37.46573471, 126.9483889] },
  {
    name: "법대.사회대입구(중앙대학교 방면)",
    position: [37.46279828, 126.9489902],
  },
  {
    name: "자연대.행정관입구(중앙대학교 방면)",
    position: [37.46027459, 126.9488328],
  },
  { name: "농생대(중앙대학교 방면)", position: [37.45716298, 126.949167] },
  { name: "공대입구(중앙대학교 방면)", position: [37.45493101, 126.9498438] },
  { name: "신소재(중앙대학교 방면)", position: [37.45349631, 126.9502262] },
  {
    name: "건설환경종합연구소앞(중앙대학교 방면)",
    position: [37.44720025, 126.9496964],
  },
  { name: "제2공학관(중앙대학교 방면)", position: [37.4487952, 126.9520773] },
  {
    name: "유회진학술정보관.제1공학관(중앙대학교 방면)",
    position: [37.451283, 126.952595],
  },
  {
    name: "에너지자원연구소(중앙대학교 방면)",
    position: [37.45359525, 126.9522142],
  },
  { name: "공대입구(중앙대학교 방면)", position: [37.455364, 126.9498964] },
  { name: "농생대(중앙대학교 방면)", position: [37.45711284, 126.9493877] },
  {
    name: "자연대.행정관입구(중앙대학교 방면)",
    position: [37.45998981, 126.948956],
  },
  { name: "문화관입구(중앙대학교 방면)", position: [37.46148685, 126.9494504] },
  {
    name: "법대.사회대입구(중앙대학교 방면)",
    position: [37.46326054, 126.9490724],
  },
  { name: "서울대정문(중앙대학교 방면)", position: [37.46537547, 126.9486358] },
  {
    name: "서울대학교(중앙대학교 방면)",
    position: [37.46685391, 126.9488427043],
  },
  {
    name: "서울대학교.치과병원.동물병원(중앙대학교 방면)",
    position: [37.46927442, 126.9520816],
  },
  {
    name: "서울여상.서울문영여중고앞(중앙대학교 방면)",
    position: [37.47316048, 126.9533001],
  },
  {
    name: "관악구청(중앙대학교 방면)",
    position: [37.47825141, 126.9524998],
  },
  {
    name: "서울대입구역(중앙대학교 방면)",
    position: [37.48011095, 126.9527298],
  },
  {
    name: "서울대입구역(신림2동차고지 방면)",
    position: [37.48070059, 126.952444],
  },
  {
    name: "관악경찰서.관악소방서(신림2동차고지 방면)",
    position: [37.475253, 126.952572],
  },
  {
    name: "서울여상.서울문영여중고앞(신림2동차고지 방면)",
    position: [37.473002, 126.952845],
  },
  {
    name: "서울대학교.치과병원.동물병원(신림2동차고지 방면)",
    position: [37.470034, 126.951937],
  },
  // 중복된 정류장이라 주석처리
  // {
  //   name: "서울대학교(신림2동차고지 방면)",
  //   position: [37.4667414611, 126.9479522861],
  // },
  {
    name: "경영대.행정대학원(신림2동차고지 방면)",
    position: [37.46580585, 126.9509996],
  },
  {
    name: "수의대입구.보건대학원앞(신림2동차고지 방면)",
    position: [37.46583771, 126.9546455],
  },
  {
    name: "국제대학원(신림2동차고지 방면)",
    position: [37.46370892, 126.9549273],
  },
  {
    name: "관악사삼거리(신림2동차고지 방면)",
    position: [37.460528, 126.95666],
  },
  {
    name: "공동기기원(신림2동차고지 방면)",
    position: [37.45511895, 126.9544666],
  },
  {
    name: "유전공학연구소.반도체공동연구소(신림2동차고지 방면)",
    position: [37.45374769, 126.9535516],
  },
  // 중복된 정류장이라 주석처리
  // {
  //   name: "에너지자원연구소(신림2동차고지 방면)",
  //   position: [37.45359525, 126.9522142],
  // },
  // { name: "신소재(신림2동차고지 방면)", position: [37.45349631, 126.9502262] },
  // {
  //   name: "건설환경종합연구소앞(신림2동차고지 방면)",
  //   position: [37.44720025, 126.9496964],
  // },
  // {
  //   name: "제2공학관(신림2동차고지 방면)",
  //   position: [37.4487952, 126.9520773],
  // },
  // {
  //   name: "유회진학술정보관.제1공학관(신림2동차고지 방면)",
  //   position: [37.451283, 126.952595],
  // },
  // {
  //   name: "에너지자원연구소(신림2동차고지 방면)",
  //   position: [37.45359525, 126.9522142],
  // },
  // { name: "공대입구(신림2동차고지 방면)", position: [37.455364, 126.9498964] },
  // { name: "농생대(신림2동차고지 방면)", position: [37.45711284, 126.9493877] },
  // {
  //   name: "자연대.행정관입구(신림2동차고지 방면)",
  //   position: [37.45998981, 126.948956],
  // },
  // {
  //   name: "문화관입구(신림2동차고지 방면)",
  //   position: [37.46148685, 126.9494504],
  // },
  // {
  //   name: "법대.사회대입구(신림2동차고지 방면)",
  //   position: [37.46326054, 126.9490724],
  // },
  // {
  //   name: "서울대정문(신림2동차고지 방면)",
  //   position: [37.46537547, 126.9486358],
  // },
  {
    name: "신림중.삼성고.관악아트홀·도서관(신림2동차고지 방면)",
    position: [37.47055199, 126.944133],
  },
];

// 중앙대학교 방면 버스 정류장 폴리라인 표시를 위한 5511번 버스 정류장 위치 좌표 배열
// -> 폴리라인의 좌표 구체화를 위해 좁은 간격으로 정류장 좌표를 나열
export const bus_5511Stations_forStartPolyline = [
  {
    name: "서울대학교(중앙대학교 방면)-건설환경종합연구소앞(중앙대학교 방면)",
    origin: [37.4667414611, 126.9479522861],
    destination: [37.44720025, 126.9496964],
  },
  {
    name: "건설환경종합연구소앞(중앙대학교 방면)-유회진학술정보관.제1공학관(중앙대학교 방면)",
    origin: [37.44720025, 126.9496964],
    destination: [37.451283, 126.952595],
  },
  {
    name: "유회진학술정보관.제1공학관(중앙대학교 방면)-공대입구(중앙대학교 방면)",
    origin: [37.451283, 126.952595],
    destination: [37.455364, 126.9498964],
  },
  {
    name: "공대입구(중앙대학교 방면)-서울대학교(중앙대학교 방면)",
    origin: [37.455364, 126.9498964],
    destination: [37.46685391, 126.9488427043],
  },
  {
    name: "서울대학교(중앙대학교 방면)-서울대입구역(중앙대학교 방면)",
    origin: [37.46685391, 126.9488427043],
    destination: [37.48011095, 126.9527298],
  },
];

// 신림2동차고지 방면 버스 정류장 폴리라인 표시를 위한 5511번 버스 정류장 위치 좌표 배열
// -> 폴리라인의 좌표 구체화를 위해 좁은 간격으로 정류장 좌표를 나열
export const bus_5511Stations_forEndPolyline = [
  {
    name: "서울대입구역(신림2동차고지 방면)-서울대학교(신림2동차고지 방면)",
    origin: [37.48070059, 126.952444],
    destination: [37.4667414611, 126.9479522861],
  },
  {
    name: "서울대학교(신림2동차고지 방면)-수의대입구.보건대학원앞(신림2동차고지 방면)",
    origin: [37.4667414611, 126.9479522861],
    destination: [37.46583771, 126.9546455],
  },
  {
    name: "수의대입구.보건대학원앞(신림2동차고지 방면)-유전공학연구소.반도체공동연구소(신림2동차고지 방면)",
    origin: [37.46583771, 126.9546455],
    destination: [37.45374769, 126.9535516],
  },
  {
    name: "유전공학연구소.반도체공동연구소(신림2동차고지 방면)-신소재(신림2동차고지 방면)",
    origin: [37.45374769, 126.9535516],
    destination: [37.45349631, 126.9502262],
  },
  {
    name: "신소재(신림2동차고지 방면)-건설환경종합연구소앞(신림2동차고지 방면)",
    origin: [37.45349631, 126.9502262],
    destination: [37.44720025, 126.9496964],
  },
  {
    name: "건설환경종합연구소앞(신림2동차고지 방면)-유회진학술정보관.제1공학관(신림2동차고지 방면)",
    origin: [37.44720025, 126.9496964],
    destination: [37.451283, 126.952595],
  },
  {
    name: "유회진학술정보관.제1공학관(신림2동차고지 방면)-에너지자원연구소(신림2동차고지 방면)",
    origin: [37.451283, 126.952595],
    destination: [37.45359525, 126.9522142],
  },
  {
    name: "에너지자원연구소(신림2동차고지 방면)-서울대정문(신림2동차고지 방면)",
    origin: [37.45359525, 126.9522142],
    destination: [37.46537547, 126.9486358],
  },
  {
    name: "서울대정문(신림2동차고지 방면)-신림중.삼성고.관악아트홀·도서관(신림2동차고지 방면)",
    origin: [37.46537547, 126.9486358],
    destination: [37.47055199, 126.944133],
  },
];
