// 중앙대학교 방면 버스 정류장 폴리라인 표시를 위한 5511번 버스 정류장 위치 좌표 배열
// -> 폴리라인의 좌표 구체화를 위해 좁은 간격으로 정류장 좌표를 나열
export const bus_5511Stations_forStartPolyline = [
  {
    name: "서울대학교(중앙대학교 방면)-건설환경종합연구소앞(중앙대학교 방면)",
    origin: [37.4667414611, 126.9479522861],
    destination: [37.44720025, 126.9496964],
  },
  {
    name: "건설환경종합연구소앞(중앙대학교 방면)-유회진학술정보관.제1공학관(중앙대학교 방면)",
    origin: [37.44720025, 126.9496964],
    destination: [37.451283, 126.952595],
  },
  {
    name: "유회진학술정보관.제1공학관(중앙대학교 방면)-공대입구(중앙대학교 방면)",
    origin: [37.451283, 126.952595],
    destination: [37.455364, 126.9498964],
  },
  {
    name: "공대입구(중앙대학교 방면)-서울대정문(중앙대학교 방면)",
    origin: [37.455364, 126.9498964],
    destination: [37.46537547, 126.9486358],
  },
  {
    name: "서울대정문(중앙대학교 방면)-서울대학교(중앙대학교 방면)",
    origin: [37.46537547, 126.9486358],
    destination: [37.46685391, 126.9488427043],
  },
  {
    name: "서울대학교(중앙대학교 방면)-서울대학교.치과병원.동물병원(중앙대학교 방면)",
    origin: [37.46685391, 126.9488427043],
    destination: [37.46927442, 126.9520816],
  },
  {
    name: "서울대학교.치과병원.동물병원(중앙대학교 방면)-서울대입구역(중앙대학교 방면)",
    origin: [37.46927442, 126.9520816],
    destination: [37.48011095, 126.9527298],
  },
];

// 신림2동차고지 방면 버스 정류장 폴리라인 표시를 위한 5511번 버스 정류장 위치 좌표 배열
// -> 폴리라인의 좌표 구체화를 위해 좁은 간격으로 정류장 좌표를 나열
export const bus_5511Stations_forEndPolyline = [
  {
    name: "서울대입구역(신림2동차고지 방면)-서울대학교(신림2동차고지 방면)",
    origin: [37.48070059, 126.952444],
    destination: [37.4667414611, 126.9479522861],
  },
  {
    name: "서울대학교(신림2동차고지 방면)-경영대.행정대학원(신림2동차고지 방면)",
    origin: [37.4667414611, 126.9479522861],
    destination: [37.46580585, 126.9509996],
  },
  {
    name: "경영대.행정대학원(신림2동차고지 방면)-수의대입구.보건대학원앞(신림2동차고지 방면)",
    origin: [37.46580585, 126.9509996],
    destination: [37.46583771, 126.9546455],
  },
  {
    name: "수의대입구.보건대학원앞(신림2동차고지 방면)-유전공학연구소.반도체공동연구소(신림2동차고지 방면)",
    origin: [37.46583771, 126.9546455],
    destination: [37.45374769, 126.9535516],
  },
  {
    name: "유전공학연구소.반도체공동연구소(신림2동차고지 방면)-신소재(신림2동차고지 방면)",
    origin: [37.45374769, 126.9535516],
    destination: [37.45349631, 126.9502262],
  },
  {
    name: "신소재(신림2동차고지 방면)-건설환경종합연구소앞(신림2동차고지 방면)",
    origin: [37.45349631, 126.9502262],
    destination: [37.44720025, 126.9496964],
  },
  {
    name: "건설환경종합연구소앞(신림2동차고지 방면)-유회진학술정보관.제1공학관(신림2동차고지 방면)",
    origin: [37.44720025, 126.9496964],
    destination: [37.451283, 126.952595],
  },
  {
    name: "유회진학술정보관.제1공학관(신림2동차고지 방면)-에너지자원연구소(신림2동차고지 방면)",
    origin: [37.451283, 126.952595],
    destination: [37.45359525, 126.9522142],
  },
  {
    name: "에너지자원연구소(신림2동차고지 방면)-서울대정문(신림2동차고지 방면)",
    origin: [37.45359525, 126.9522142],
    destination: [37.46537547, 126.9486358],
  },
  {
    name: "서울대정문(신림2동차고지 방면)-신림중.삼성고.관악아트홀·도서관(신림2동차고지 방면)",
    origin: [37.46537547, 126.9486358],
    destination: [37.47055199, 126.944133],
  },
];
